/*/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/
/*--------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                                              МИШЕНЬ 1                                                                     */
/*------------------------------------------------------------------------------------------------------------------------------------------*/
/*/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/

#include "Pawns/TIREnemyType01.h"
#include "Component/TIRTargetMovementComponent.h"
#include "Components/SphereComponent.h"

ATIREnemyType01::ATIREnemyType01(const FObjectInitializer& ObjectInitializer)
	: Super(ObjectInitializer)
{
	SetSizeEnemy(0.50f); // Устанавливаем размер мишени первому типу мишени
	SetColorEnemy(FLinearColor::Red); // Устанавливаем цвет первому типу мишени
	GetMovementComponent()->SetSpeedMovement(250.0f); // Устанавливаем скорость первому типу мишени
	SetHealthMax(100.0f); // Устанавливаем максимальное кол-во здоровья первому типу мишени
	SetHealthCurrent(100.0f); // Устанавливаем текущее кол-во здоровья первому типу мишени
}