/*/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/
/*--------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                                              МИШЕНЬ 2                                                                     */
/*------------------------------------------------------------------------------------------------------------------------------------------*/
/*/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/

#include "Pawns/TIREnemyType02.h"
#include "Component/TIRTargetMovementComponent.h"

ATIREnemyType02::ATIREnemyType02(const FObjectInitializer& ObjectInitializer)
	: Super(ObjectInitializer)
{
	SetSizeEnemy(0.55f); // Устанавливаем размер второму типу мишени
	SetColorEnemy(FLinearColor::Yellow); // Устанавливаем цвет второму типу мишени
	GetMovementComponent()->SetSpeedMovement(400.0f); // Устанавливаем скорость второму типу мишени
	SetHealthMax(200.0f); // Устанавливаем максимальное кол-во здоровья второму типу мишени
	SetHealthCurrent(200.0f); // Устанавливаем текущее кол-во здоровья второму типу мишени
}