/*/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/
/*--------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                                              МИШЕНЬ 4                                                                     */
/*------------------------------------------------------------------------------------------------------------------------------------------*/
/*/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/

#include "Pawns/TIREnemyType04.h"
#include "Component/TIRTargetMovementComponent.h"
#include "Components/WidgetComponent.h"

ATIREnemyType04::ATIREnemyType04(const FObjectInitializer& ObjectInitializer)
	: Super(ObjectInitializer)
{
	SetSizeEnemy(0.85f); // Устанавливаем размер четвертому типу мишени
	SetColorEnemy(FLinearColor::Green); // Устанавливаем цвет четвертому типу мишени
	GetMovementComponent()->SetSpeedMovement(550.0f); // Устанавливаем скорость четвертому типу мишени
	SetHealthMax(350.0f); // Устанавливаем максимальное кол-во здоровья четвертому типу мишени
	SetHealthCurrent(350.0f); // Устанавливаем текущее кол-во здоровья четвертому типу мишени
	HealthWidgetComponent->SetWorldLocation(FVector(85.0, 0.0, 0.0)); // Устанавливаем высоту виджета здоровья
}
